Public Member Functions | Protected Member Functions | List of all members
ACAPI::v1::ElementBase Class Reference
Element Manager
A base class for all elements. More...
#include <ElementBase.hpp>
 Inheritance diagram for ACAPI::v1::ElementBase:
 Public Member Functions
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A base class for all elements.
Constructor & Destructor Documentation
◆ ElementBase()
 ACAPI::v1::ElementBase::ElementBase  |  ( |  std::shared_ptr< Impl::ObjectImpl >  |  impl | )
protected
Constructs a new ElementBase.
Parameters
impl | Impl instance of the object.
Member Function Documentation
◆ GetElemId()
 UniqueID ACAPI::v1::ElementBase::GetElemId  |  ( |   | ) |   const
Get unique identifier of the ElementBase object.
Returns
Unique identifier of the ElementBase object.
◆ IsEditable()
 Result< void > ACAPI::v1::ElementBase::IsEditable  |  ( |   | ) |   const
Checks whether the element is editable.
Returns
Returns nothing if the element is editable, otherwise the error code and error message containing information about the reason.